const quiz = [
    {
        "q" : "Начнем с простого. Как вы учились в школе?",
        "a" : {
            "c" : "Мои оценки были нормально распределены",
            "z" : "Оценки в диапазоне 3,4997 до 4,561109112",
            "x" : "[4, 4, 2, 3, 5, 4, 3, 3, 4, 4, 3, 3, 4, 4, 4, 5, 4, 5, 4, 3, 5, 4, 5]",
            "v" : "Нормально, как все, ничего необычного",
        }

    },

    {
        "q" : "На нашем направлении будет много разной математики. Как вы отноститесь к ней?",
        "a" : {
            "z" : "О-о-о, я обожаю математику!",
            "x" : "Всё хорошо с математикой",
            "c" : "Ой, с математикой дела всегда были плохи",
            "v" : "Математика не нужна, есть калькуляторы!",
        }

    },

    {
        "q" : "Что получится, если разделить какое-нибудь число на ноль?",
        "a" : {
            "v" : "Ноль",
            "z" : "Зависит от того, в какой математической системе мы находимся",
            "c" : "Бесконечность",
            "x" : "На ноль делить нельзя",
        }

    },

    {
        "q" : "Программистам часто приходится искать информацию на английском языке. Как у вас с ним?",
        "a" : {
            "z" : "Могу говорить, читать, писать и воспринимать на слух",
            "x" : "Могу читать, писать и воспринимать на слух",
            "c" : "Могу читать и писать",
            "v" : "Плохо знаю или не изучал английский",
        }

    },

    {
        "q" : "Как вы считаете, какой навык важнее всего для программиста?",
        "a" : {
            "c" : "Умение писать на многих языках программирования",
            "v" : "Умение читать машинный код и программировать на уровне 0 и 1",
            "z" : "Умение алгоритмически мыслить и писать понятный код",
            "x" : "Умение гуглить ... много гуглить",
  
        }

    },

    {
        "q" : "А как у вас с программированием?",
        "a" : {
            "z" : "Изучал C/C++, Python или Java",
            "x" : "В школе писали код на Basic или Pascal",
            "c" : "У нас был только алгоритмический язык",
            "v" : "Никогда не программировал",
        }

    },

    {
        "q" : "Вопрос на засыпку. Функция – это...",
        "a" : {
            "x" : "Отдельный кусок кода, который отвечает за что-то свое",
            "z" : "Функция? А где объекты и классы?",
            "v" : "Когда человек исполняет роль, отведенную обществом или государством",
            "c" : "Что-то из математики",
        }

    },

    {
        "q" : "Программистам постоянно приходится искать решения для задач разной сложности. А как вы подходите к решению задач?",
        "a" : {
            "v" : "Не люблю решать задачи, фу-фу-фу",
            "x" : "Буду сидеть над задачей, пока не придумаю решение",
            "z" : "Предпочитаю загуглить и адаптировать под себя",
            "c" : "Устрою мозговой штурм с друзьями",
            
        }

    },

    {
        "q" : "Тяжело в учении, но легко в бою! Как вы относитесь к сложностям?",
        "a" : {
            "z" : "Не могу без них жить",
            "x" : "Сложности меня не пугают",
            "c" : "Если само не пройдет, то приходется разгребать",
            "v" : "Я сам их создаю!",
        }

    },

    {
        "q" : "Последний вопрос. Почему вы рассматриваете именно это направление?",
        "a" : {
            "z" : "Потому что я обожаю математику и/или информатику!",
            "x" : "Хочу стать разработчиком, востребованным на рынке труда",
            "c" : "Мне просто нужен диплом",
            "v" : "Не прошел по баллам на другие направления",
        }

    },
    

]