let answers = {
    "z" : {
        "description" : "Тебе у нас будет легко учиться, может сразу в преподаватели пойдешь?)"
    },

    "x" : {
        "description" : "Слушай, а ты хорош. Тебе определенно будет интересно учиться у нас."
    },

    "c" : {
        "description" : "Скорее всего в школе тебе не дали знаний должного уровня, но ты не переживай. Попробуй летом поизучать C/C++, это тебе очень поможет на 1-ом курсе :)"
    },

    "v" : {
        "description" : "Сэр, да вы гуманитарий..."
    }
};